<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom"><title>Programe em Python</title><link href="http://programeempython.com.br/" rel="alternate"></link><link href="http://programeempython.com.br/feeds/all.atom.xml" rel="self"></link><id>http://programeempython.com.br/</id><updated>2022-07-25T22:03:00+02:00</updated><entry><title>Porque Pelican</title><link href="http://programeempython.com.br/porque-pelican.html" rel="alternate"></link><published>2022-07-25T22:03:00+02:00</published><updated>2022-07-25T22:03:00+02:00</updated><author><name>Julio Melanda</name></author><id>tag:programeempython.com.br,2022-07-25:/porque-pelican.html</id><summary type="html">&lt;p&gt;Aqui vou apresentar alguma razões para eu ter escolhido publicar meu blog com&amp;nbsp;Pelican.&lt;/p&gt;</summary><content type="html">&lt;p&gt;Ol&amp;aacute;!&lt;/p&gt;
&lt;p&gt;Eu andei avaliando se e como eu deveria retomar o blog, e depois de muitas ideias, aqui estamos, e acho que nada como come&amp;ccedil;ar falando um pouco sobre o processo de decis&amp;atilde;o para escolher fazer o blog em Pelican hospedado no Github Pages ao inv&amp;eacute;s de qualquer outra&amp;nbsp;plataforma.&lt;/p&gt;
&lt;p&gt;Para isto acho que podemos come&amp;ccedil;ar com um pequeno hist&amp;oacute;rico do&amp;nbsp;blog.&lt;/p&gt;
&lt;p&gt;Minha primeira vers&amp;atilde;o do Programe em Python foi no Blogger. Era bastante f&amp;aacute;cil e pr&amp;aacute;tico de in&amp;iacute;cio, por&amp;eacute;m, para customizar as p&amp;aacute;ginas era um tanto trabalhoso devido &amp;agrave;s especificidades dos templates &lt;span class="caps"&gt;HTML&lt;/span&gt; do&amp;nbsp;Blogger.&lt;/p&gt;
&lt;p&gt;Depois, migrei para uma solu&amp;ccedil;&amp;atilde;o django rodando no openshift da redhat. Eu adorava. 100% customizavel, meus textos saiam bem como eu queria, mas depois de um tempo, o openshift teve mudan&amp;ccedil;as pras quais eu demorei pra me atentar e tive que fazer um backup super corrido dos textos e infelizmente n&amp;atilde;o consegui mais continuar com o&amp;nbsp;blog.&lt;/p&gt;
&lt;p&gt;Um tempo depois eu descobri github pages e pelican e fiz uma tentativa inicial, mas n&amp;atilde;o estava num bom momento e o projeto mais uma vez n&amp;atilde;o foi pra&amp;nbsp;frente.&lt;/p&gt;
&lt;p&gt;Agora, quando decidi retomar o blog tive que escolher entre continuar usando github pages e pelican ou procurar uma nova&amp;nbsp;plataforma.&lt;/p&gt;
&lt;p&gt;Minha escolha teve alguns pontos&amp;nbsp;decisivos.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;O blog &amp;eacute; um site est&amp;aacute;tico e dificilmente vou precisar de muito mais do que um site est&amp;aacute;tico pode me oferecer, dado que o Pelican simplifica muito a postagem dos textos e acrescentar as&amp;nbsp;p&amp;aacute;ginas.&lt;/li&gt;
&lt;li&gt;Git &amp;eacute; um sistema que eu uso diariamente e que eu sempre recomendo, al&amp;eacute;m de permitir versionamento dos texto, o que pode ser bastante &amp;uacute;til, eu posso escrever de basicamente qualquer lugar e enviar facilmente para o&amp;nbsp;github.&lt;/li&gt;
&lt;li&gt;Pelican &amp;eacute; um gerador de sites est&amp;aacute;ticos, que me permite facilmente acrescentar novos posts ao blog, escrevendo com&amp;nbsp;Markdown&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Alguns pontos precisei levar em considera&amp;ccedil;&amp;atilde;o s&amp;atilde;o que o Pelican n&amp;atilde;o tem um suporte nativo no Github Pages como tem o Jekyll por exemplo, e para ter busca e outras features, precisei de alguns plugins do pelican. Isto aumenta um pouco as complexidades, por&amp;eacute;m n&amp;atilde;o o suficiente para me&amp;nbsp;desanimar.&lt;/p&gt;
&lt;p&gt;Algo que eu fiz tamb&amp;eacute;m foi implementar um workflow no CircleCI para publicar a postagem quando eu fizer um commit na branch do blog, assim, a publica&amp;ccedil;&amp;atilde;o que dependeria de eu rodar alguns comandos do pelican fica&amp;nbsp;automatizada.&lt;/p&gt;
&lt;p&gt;Uma pergunta que pode ficar &amp;eacute;, por que usei Pelican no lugar de Jekyll ou Hugo por&amp;nbsp;exemplo?&lt;/p&gt;
&lt;p&gt;Minha ideia neste sentido foi bem simples. Eu queria um gerador de site est&amp;aacute;tico feito em Python. Assim, se eu eu sentir que preciso de algo ou que tem um bug eu posso trabalhar na mudan&amp;ccedil;a&amp;nbsp;facilmente.&lt;/p&gt;
&lt;p&gt;Tamb&amp;eacute;m, Pelican usa Jinja2 para os templates, e esta biblioteca eu j&amp;aacute; usei diversas vezes, al&amp;eacute;m de ser parecida com a biblioteca de templates do&amp;nbsp;Django.&lt;/p&gt;
&lt;p&gt;Assim, aqui estamos. Um blog usando Pelican para gerar o site, o host sendo o sistema de pages do github, e com CircleCI automatizando as publica&amp;ccedil;&amp;otilde;es quando eu envio os&amp;nbsp;posts.&lt;/p&gt;
&lt;p&gt;Espero que tenham gostado. Quer saber mais sobre como funciona o Pelican, ou como criar seu pr&amp;oacute;prio blog usando esta&amp;nbsp;stack?&lt;/p&gt;
&lt;p&gt;Deixe seu&amp;nbsp;coment&amp;aacute;rio!&lt;/p&gt;
&lt;p&gt;Abra&amp;ccedil;o!&lt;/p&gt;</content><category term="Blogging"></category><category term="Geral"></category><category term="Blogging"></category></entry><entry><title>Um novo começo</title><link href="http://programeempython.com.br/um-novo-comeco.html" rel="alternate"></link><published>2022-07-21T11:52:00+02:00</published><updated>2022-07-21T11:52:00+02:00</updated><author><name>Julio Melanda</name></author><id>tag:programeempython.com.br,2022-07-21:/um-novo-comeco.html</id><summary type="html">&lt;p&gt;Estamos aqui mais uma vez recomeçando este lindo blog que tem como intuito ensinar python e também compartilhar um pouco das minhas experiências e desafios com esta tão amada tecnologia&amp;nbsp;:D&lt;/p&gt;</summary><content type="html">&lt;p&gt;Estamos aqui mais uma vez recome&amp;ccedil;ando este lindo blog que tem como intuito ensinar python e tamb&amp;eacute;m compartilhar um pouco das minhas experi&amp;ecirc;ncias e desafios com esta t&amp;atilde;o amada&amp;nbsp;tecnologia.&lt;/p&gt;
&lt;p&gt;Voc&amp;ecirc; pode esperar que apesar este site tenha sempre conte&amp;uacute;dos de qualidade, e voc&amp;ecirc; pode tirar todas as d&amp;uacute;vidas diretamente comigo nos coment&amp;aacute;rios ou redes sociais&amp;nbsp;:D&lt;/p&gt;
&lt;p&gt;At&amp;eacute; o pr&amp;oacute;ximo&amp;nbsp;post!&lt;/p&gt;</content><category term="Geral"></category><category term="Geral"></category></entry></feed>